app/views/posts/show.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
      <br>
      <% @post.replies.each do |reply| %>