app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "What do you think of the book?"], ["content", "Well? "], ["user_id", 1], ["created_at", "2016-10-17 13:36:42.060959"], ["updated_at", "2016-10-17 13:36:42.060959"]]
---
  def create
    @post = Post.new(post_params.permit(:title, :content))
    @post.user_id = current_user.id
    if @post.save