app/controllers/replies_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @reply = Reply.new(reply_params)
    @reply.user_id = current_user.id
    @reply.post_id = params[:post_id]
    if @reply.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "replies" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdf"], ["user_id", 1], ["post_id", 1], ["created_at", "2016-10-24 02:49:06.253751"], ["updated_at", "2016-10-24 02:49:06.253751"]]